{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 50, 30], "dtype": "int32", "sparse": false, "name": "history_input"}, "registered_name": null, "name": "history_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "candidate_input"}, "registered_name": null, "name": "candidate_input", "inbound_nodes": []}, {"module": "utils", "class_name": "UserEncoder", "config": {"name": "user_encoder", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "embedding_dim": 256}, "registered_name": "Custom>UserEncoder", "build_config": {"input_shape": [null, 50, 30]}, "name": "user_encoder", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 50, 30], "dtype": "int32", "keras_history": ["history_input", 0, 0]}}], "kwargs": {}}]}, {"module": "utils", "class_name": "NewsEncoder", "config": {"name": "news_encoder", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "vocab_size": 88583, "embedding_dim": 256, "dropout_rate": 0.2, "nb_head": 8, "size_per_head": 32}, "registered_name": "Custom>NewsEncoder", "build_config": {"input_shape": [null, 30]}, "name": "news_encoder", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30], "dtype": "int32", "keras_history": ["candidate_input", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dot", "config": {"name": "dot", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axes": -1, "normalize": false}, "registered_name": null, "build_config": {"input_shape": [[null, 256], [null, 256]]}, "name": "dot", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["user_encoder", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["news_encoder", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["dot", 0, 0]}}], "kwargs": {}}]}], "input_layers": {"history_input": ["history_input", 0, 0], "candidate_input": ["candidate_input", 0, 0]}, "output_layers": [["activation", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "binary_crossentropy", "loss_weights": null, "metrics": [{"module": "keras.metrics", "class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}, "registered_name": null}, {"module": "keras.metrics", "class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}, "registered_name": null}, {"module": "keras.metrics", "class_name": "AUC", "config": {"name": "AUC", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_labels": null, "label_weights": null, "from_logits": false}, "registered_name": null}], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}